Ludovic-Lesur/stm32l0xx-drivers/src/tim.c
/*** TIM functions ***/

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x01) != 0)
/*******************************************************************/
TIM_status_t TIM_STD_init(TIM_instance_t instance, uint32_t period_ns, uint8_t nvic_priority, TIM_completion_irq_cb_t irq_callback) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	uint32_t tim_clock_hz = 0;
	// Check instance.
	_TIM_check_instance(instance);
	// Update local interrupt handler.
	tim_irq_handler[instance] = &_TIM_STD_irq_handler;
	// Register callback.
	tim_std_ctx[instance].irq_callback = irq_callback;
	// Get clock source frequency.
	RCC_get_frequency_hz(RCC_CLOCK_SYSTEM, &tim_clock_hz);
	// Enable peripheral clock.
	(*TIM_DESCRIPTOR[instance].rcc_enr) |= TIM_DESCRIPTOR[instance].rcc_mask;
	(*TIM_DESCRIPTOR[instance].rcc_smenr) |= TIM_DESCRIPTOR[instance].rcc_mask;
	// Compute ARR and PSC values.
	status = _TIM_compute_psc_arr(instance, tim_clock_hz, period_ns);
	if (status != TIM_SUCCESS) goto errors;
	// Enable interrupt.
	TIM_DESCRIPTOR[instance].peripheral -> DIER |= (0b1 << 0);
	NVIC_set_priority(TIM_DESCRIPTOR[instance].nvic_interrupt, nvic_priority);
	// Generate event to update registers.
	TIM_DESCRIPTOR[instance].peripheral -> EGR |= (0b1 << 0); // UG='1'.
errors:
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x01) != 0)
/*******************************************************************/
TIM_status_t TIM_STD_de_init(TIM_instance_t instance) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	// Check instance.
	_TIM_check_instance(instance);
	// Release timer.
	_TIM_de_init(instance);
errors:
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x01) != 0)
/*******************************************************************/
TIM_status_t TIM_STD_start(TIM_instance_t instance) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	// Check instance.
	_TIM_check_instance(instance);
	// Enable interrupt.
	NVIC_enable_interrupt(TIM_DESCRIPTOR[instance].nvic_interrupt);
	// Start timer.
	TIM_DESCRIPTOR[instance].peripheral -> CR1 |= (0b1 << 0);
errors:
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x01) != 0)
/*******************************************************************/
TIM_status_t TIM_STD_stop(TIM_instance_t instance) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	// Check instance.
	_TIM_check_instance(instance);
	// Stop timer.
	TIM_DESCRIPTOR[instance].peripheral -> CR1 &= ~(0b1 << 0);
	// Disable interrupt.
	NVIC_disable_interrupt(TIM_DESCRIPTOR[instance].nvic_interrupt);
errors:
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x02) != 0)
/*******************************************************************/
TIM_status_t TIM_MCH_init(TIM_instance_t instance, uint8_t nvic_priority) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	uint32_t tim_clock_hz = 0;
	uint8_t idx = 0;
#if (STM32L0XX_DRIVERS_RCC_LSE_MODE == 1)
	uint8_t lse_status = 0;
#endif
	// Check instance.
	_TIM_check_instance(instance);
	// Check supported instances.
	if (instance != TIM_INSTANCE_TIM2) {
		status = TIM_ERROR_INSTANCE;
		goto errors;
	}
	// Init context.
	for (idx=0 ; idx<TIM_CHANNEL_LAST ; idx++) {
		tim_mch_ctx.channel[idx].duration_ms = 0;
		tim_mch_ctx.channel[idx].waiting_mode = TIM_WAITING_MODE_ACTIVE;
		tim_mch_ctx.channel[idx].running_flag = 0;
		tim_mch_ctx.channel[idx].irq_flag = 0;
	}
	// Init common context.
	tim_irq_handler[instance] = &_TIM_MCH_irq_handler;
	// Select trigger.
#if (STM32L0XX_DRIVERS_RCC_LSE_MODE == 0)
	tim_mch_ctx.clock_source = RCC_CLOCK_HSI;
#elif (STM32L0XX_DRIVERS_RCC_LSE_MODE == 1)
	RCC_get_status(RCC_CLOCK_LSE, &lse_status);
	tim_mch_ctx.clock_source = (lse_status != 0) ? RCC_CLOCK_LSE : RCC_CLOCK_HSI;
#else
	tim_mch_ctx.clock_source = RCC_CLOCK_LSE;
#endif
	// Get clock source frequency.
	RCC_get_frequency_hz(tim_mch_ctx.clock_source, &tim_clock_hz);
	// Enable peripheral clock.
	(*TIM_DESCRIPTOR[instance].rcc_enr) |= TIM_DESCRIPTOR[instance].rcc_mask;
	(*TIM_DESCRIPTOR[instance].rcc_smenr) |= TIM_DESCRIPTOR[instance].rcc_mask;
	// Configure channels.
#if (STM32L0XX_DRIVERS_RCC_LSE_MODE == 0)
	RCC -> CR |= (0b1 << 5); // HSI16OUTEN='1'.
	TIM_DESCRIPTOR[instance].peripheral -> SMCR |= (0b11 << 12); // ETRF prescaler = 8 (minimum 4 due to CK_INT clock ratio constraint).
	TIM_DESCRIPTOR[instance].peripheral -> PSC = (TIM_MCH_PRESCALER_PSC_HSI - 1);
	TIM_DESCRIPTOR[instance].peripheral -> OR |= (0b011 << 0);
	// Update clock frequency.
	tim_mch_ctx.etrf_clock_hz = ((tim_clock_hz) / (TIM_MCH_PRESCALER_ETRF_HSI * TIM_MCH_PRESCALER_PSC_HSI));
#elif (STM32L0XX_DRIVERS_RCC_LSE_MODE == 1)
	// Select trigger.
	if (lse_status != 0) {
		// Use LSE as trigger.
		RCC -> CR &= ~(0b1 << 5); // HSI16OUTEN='0'.
		TIM_DESCRIPTOR[instance].peripheral -> SMCR &= ~(0b11 << 12); // No prescaler on ETRF.
		TIM_DESCRIPTOR[instance].peripheral -> PSC = (TIM_MCH_PRESCALER_PSC_LSE - 1);
		TIM_DESCRIPTOR[instance].peripheral -> OR |= (0b101 << 0);
		// Update clock frequency.
		tim_mch_ctx.etrf_clock_hz = ((tim_clock_hz) / (TIM_MCH_PRESCALER_ETRF_LSE * TIM_MCH_PRESCALER_PSC_LSE));
	}
	else {
		// Use HSI as trigger.
		RCC -> CR |= (0b1 << 5); // HSI16OUTEN='1'.
		TIM_DESCRIPTOR[instance].peripheral -> SMCR |= (0b11 << 12); // ETRF prescaler = 8 (minimum 4 due to CK_INT clock ratio constraint).
		TIM_DESCRIPTOR[instance].peripheral -> PSC = (TIM_MCH_PRESCALER_PSC_HSI - 1);
		TIM_DESCRIPTOR[instance].peripheral -> OR |= (0b011 << 0);
		/// Update clock frequency.
		tim_mch_ctx.etrf_clock_hz = ((tim_clock_hz) / (TIM_MCH_PRESCALER_ETRF_HSI * TIM_MCH_PRESCALER_PSC_HSI));
	}
#else
	// Use LSE as trigger.
	RCC -> CR &= ~(0b1 << 5); // HSI16OUTEN='0'.
	TIM_DESCRIPTOR[instance].peripheral -> SMCR &= ~(0b11 << 12); // No prescaler on ETRF.
	TIM_DESCRIPTOR[instance].peripheral -> PSC = (TIM_MCH_PRESCALER_PSC_LSE - 1);
	TIM_DESCRIPTOR[instance].peripheral -> OR |= (0b101 << 0);
	// Update clock frequency.
	tim_mch_ctx.etrf_clock_hz = ((tim_clock_hz) / (TIM_MCH_PRESCALER_ETRF_LSE * TIM_MCH_PRESCALER_PSC_LSE));
#endif
	// No overflow.
	TIM_DESCRIPTOR[instance].peripheral -> ARR = TIM_ARR_VALUE_MAX;
	// Use external clock mode 2.
	TIM_DESCRIPTOR[instance].peripheral -> SMCR |= (0b1 << 14) | (0b111 << 4);
	// Configure channels 1-4 in output compare mode.
	TIM_DESCRIPTOR[instance].peripheral -> CCMR1 &= 0xFFFF0000;
	TIM_DESCRIPTOR[instance].peripheral -> CCMR2 &= 0xFFFF0000;
	TIM_DESCRIPTOR[instance].peripheral -> CCER &= 0xFFFF0000;
	// Set interrupt priority.
	NVIC_set_priority(TIM_DESCRIPTOR[instance].nvic_interrupt, nvic_priority);
	// Generate event to update registers.
	TIM_DESCRIPTOR[instance].peripheral -> EGR |= (0b1 << 0); // UG='1'.
errors:
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x02) != 0)
/*******************************************************************/
TIM_status_t TIM_MCH_de_init(TIM_instance_t instance) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	// Check instance.
	_TIM_check_instance(instance);
	// Release timer.
	_TIM_de_init(instance);
errors:
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x02) != 0)
/*******************************************************************/
TIM_status_t TIM_MCH_start_channel(TIM_instance_t instance, TIM_channel_t channel, uint32_t duration_ms, TIM_waiting_mode_t waiting_mode) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	uint32_t local_duration_ms = duration_ms;
	uint32_t duration_min_ms = TIM_MCH_TIMER_DURATION_MS_MIN;
	// Check instance and channel.
	_TIM_check_instance(instance);
	_TIM_check_channel(channel);
	// Check parameters.
	if (waiting_mode >= TIM_WAITING_MODE_LAST) {
		status = TIM_ERROR_WAITING_MODE;
		goto errors;
	}
	if (waiting_mode == TIM_WAITING_MODE_LOW_POWER_SLEEP) {
		// Compensate clock switch latency.
		duration_min_ms += TIM_MCH_CLOCK_SWITCH_LATENCY_MS;
	}
	if (duration_ms < duration_min_ms) {
		status = TIM_ERROR_DURATION_UNDERFLOW;
		goto errors;
	}
	if (duration_ms > TIM_MCH_TIMER_DURATION_MS_MAX) {
		status = TIM_ERROR_DURATION_OVERFLOW;
		goto errors;
	}
	if (waiting_mode == TIM_WAITING_MODE_LOW_POWER_SLEEP) {
		local_duration_ms -= TIM_MCH_CLOCK_SWITCH_LATENCY_MS;
	}
	// Update channel context.
	tim_mch_ctx.channel[channel].duration_ms = local_duration_ms;
	tim_mch_ctx.channel[channel].waiting_mode = waiting_mode;
	tim_mch_ctx.channel[channel].running_flag = 1;
	tim_mch_ctx.channel[channel].irq_flag = 0;
	// Compute compare value.
	_TIM_MCH_compute_compare_value(instance, channel);
	// Clear flag.
	TIM_DESCRIPTOR[instance].peripheral -> SR &= ~(0b1 << (channel + 1));
	// Enable channel.
	TIM_DESCRIPTOR[instance].peripheral -> DIER |= (0b1 << (channel + 1));
	// Enable interrupt.
	NVIC_enable_interrupt(TIM_DESCRIPTOR[instance].nvic_interrupt);
	// Enable counter.
	TIM_DESCRIPTOR[instance].peripheral -> CR1 |= (0b1 << 0);
errors:
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x02) != 0)
/*******************************************************************/
TIM_status_t TIM_MCH_stop_channel(TIM_instance_t instance, TIM_channel_t channel) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	// Check instance and channel.
	_TIM_check_instance(instance);
	_TIM_check_channel(channel);
	// Disable interrupt.
	TIM_DESCRIPTOR[instance].peripheral -> DIER &= ~(0b1 << (channel + 1));
	// Clear flag.
	TIM_DESCRIPTOR[instance].peripheral -> SR &= ~(0b1 << (channel + 1));
	// Disable channel.
	tim_mch_ctx.channel[channel].running_flag = 0;
	tim_mch_ctx.channel[channel].irq_flag = 0;
	// Disable counter if all channels are stopped.
	if (((TIM_DESCRIPTOR[instance].peripheral -> DIER) & 0x0000001E) == 0) {
		// Disable counter.
		TIM_DESCRIPTOR[instance].peripheral -> CR1 &= ~(0b1 << 0);
		// Disable interrupt.
		NVIC_enable_interrupt(TIM_DESCRIPTOR[instance].nvic_interrupt);
	}
errors:
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x02) != 0)
/*******************************************************************/
TIM_status_t TIM_MCH_get_channel_status(TIM_instance_t instance, TIM_channel_t channel, uint8_t* timer_has_elapsed) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	// Check instance and channel.
	_TIM_check_instance(instance);
	_TIM_check_channel(channel);
	// Check parameters.
	if (timer_has_elapsed == NULL) {
		status = TIM_ERROR_NULL_PARAMETER;
		goto errors;
	}
	// Update flag.
	(*timer_has_elapsed) = ((tim_mch_ctx.channel[channel].running_flag == 0) || (tim_mch_ctx.channel[channel].irq_flag != 0)) ? 1 : 0;
errors:
	return status;
}
#endif

#if ((STM32L0XX_DRIVERS_TIM_MODE_MASK & 0x02) != 0)
/*******************************************************************/
TIM_status_t TIM_MCH_wait_channel_completion(TIM_instance_t instance, TIM_channel_t channel) {
	// Local variables.
	TIM_status_t status = TIM_SUCCESS;
	RCC_status_t rcc_status = RCC_SUCCESS;
	uint32_t time_start = RTC_get_uptime_seconds();
	uint32_t time_reference = 0;
	// Check instance and channel.
	_TIM_check_instance(instance);
	_TIM_check_channel(channel);
	// Directly exit if the IRQ already occurred.
	if ((tim_mch_ctx.channel[channel].running_flag == 0) || (tim_mch_ctx.channel[channel].irq_flag != 0)) goto errors;
	// Sleep until channel is not running.
	switch (tim_mch_ctx.channel[channel].waiting_mode) {
	case TIM_WAITING_MODE_ACTIVE:
		// Active loop.
		while (tim_mch_ctx.channel[channel].irq_flag == 0) {
			// Internal watchdog.
			status = _TIM_MCH_internal_watchdog(time_start, &time_reference);
			if (status != TIM_SUCCESS) goto errors;
		}
		break;
	case TIM_WAITING_MODE_SLEEP:
		// Enter sleep mode.
		while (tim_mch_ctx.channel[channel].irq_flag == 0) {
			PWR_enter_sleep_mode();
			// Internal watchdog.
			status = _TIM_MCH_internal_watchdog(time_start, &time_reference);
			if (status != TIM_SUCCESS) goto errors;
		}
		break;
	case TIM_WAITING_MODE_LOW_POWER_SLEEP:
		// Check trigger source.
		if (tim_mch_ctx.clock_source == RCC_CLOCK_LSE) {
			// Switch to MSI.
			rcc_status = RCC_switch_to_msi(RCC_MSI_RANGE_1_131KHZ);
			RCC_exit_error(TIM_ERROR_BASE_RCC);
			// Enter low power sleep mode.
			while (tim_mch_ctx.channel[channel].irq_flag == 0) {
				PWR_enter_low_power_sleep_mode();
				// Internal watchdog.
				status = _TIM_MCH_internal_watchdog(time_start, &time_reference);
				if (status != TIM_SUCCESS) goto errors;
			}
			// Go back to HSI.
			rcc_status = RCC_switch_to_hsi();
			RCC_exit_error(TIM_ERROR_BASE_RCC);
		}
		else {
			// Enter sleep mode.
			while (tim_mch_ctx.channel[channel].irq_flag == 0) {
				PWR_enter_sleep_mode();
				// Internal watchdog.
				status = _TIM_MCH_internal_watchdog(time_start, &time_reference);
				if (status != TIM_SUCCESS) goto errors;
			}
		}
		break;
	default:
		status = TIM_ERROR_WAITING_MODE;
		goto errors;
	}
	// Clear flag and update compare value for next IRQ.
	tim_mch_ctx.channel[channel].irq_flag = 0;
	_TIM_MCH_compute_compare_value(instance, channel);
errors:
	return status;
}
#endif

